<script setup lang="ts">
import DialogModal from '@/components/modals/DialogModal.vue'
import DialogModal2 from '@/components/modals/DialogModal2.vue'
const modalIsOpen = ref(false)
const modalIsOpen2 = ref(false)
const handleDialog = () => {
  modalIsOpen.value = !modalIsOpen.value
}
const handleDialog2 = () => {
  modalIsOpen2.value = !modalIsOpen2.value
}
</script>

<template>
  <div>
    <button type="button" @click="handleDialog">Open Dialog</button>
    <DialogModal :open="modalIsOpen"></DialogModal>
    <button type="button" @click="handleDialog2">Open Dialog2</button>
    <DialogModal2 :open="modalIsOpen2"></DialogModal2>
    <p>
      대법원에 대법관을 둔다. 다만, 법률이 정하는 바에 의하여 대법관이 아닌
      법관을 둘 수 있다. 대통령은 제4항과 제5항의 규정에 의하여 확정된 법률을
      지체없이 공포하여야 한다. 제5항에 의하여 법률이 확정된 후 또는 제4항에
      의한 확정법률이 정부에 이송된 후 5일 이내에 대통령이 공포하지 아니할
      때에는 국회의장이 이를 공포한다. 대법원장과 대법관이 아닌 대법관회의의
      동의를 얻어 대법원장이 임명한다. 근로조건의 기준은 인간의 존엄성을
      보장하도록 법률로 정한다. 대통령은 제3항과 제4항의 사유를 지체없이
      공포하여야 한다. 법관은 헌법과 법률에 의하여 그 양심에 따라 독립하여
      심판한다. 모든 국민은 법률이 정하는 바에 의하여 납세의 의무를 진다. 위원은
      탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다.
      국채를 모집하거나 예산외에 국가의 부담이 될 계약을 체결하려 할 때에는
      정부는 미리 국회의 의결을 얻어야 한다. 누구든지 체포 또는 구속의 이유와
      변호인의 조력을 받을 권리가 있음을 고지받지 아니하고는 체포 또는 구속을
      당하지 아니한다. 체포 또는 구속을 당한 자의 가족등 법률이 정하는 자에게는
      그 이유와 일시·장소가 지체없이 통지되어야 한다. 감사원의
      조직·직무범위·감사위원의 자격·감사대상공무원의 범위 기타 필요한 사항은
      법률로 정한다. 국회는 국가의 예산안을 심의·확정한다. 군인 또는 군무원이
      아닌 국민은 대한민국의 영역안에서는 중대한 군사상
      기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한 경우와
      비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지 아니한다.
      대통령의 임기가 만료되는 때에는 임���만료 70일 내지 40일전에 후임자를
      선거한다. 대한민국의 경제질서는 개인과 기업의 경제상의 자유와 창의를
      존중함을 기본으로 한다. 제안된 헌법개정안은 대통령이 20일 이상의 기간 이를
      공고하여야 한다. 타인의 범죄행위로 인하여 생명·신체에 대한 피해를 받은
      국민은 법률이 정하는 바에 의하여 국가로부터 구조를 받을 수 있다.
      국회의원은 현행범인인 경우를 제외하고는 회기중 국회의 동의없이 체포 또는
      구금되지 아니한다. 국가는 평생교육을 진흥하여야 한다. 제1항의 해임건의는
      국회재적의원 3분의 1 이상의 발의에 의하여 국회재적의원 과반수의 찬성이
      있어야 한다. 모든 국민은 신속한 재판을 받을 권리를 가진다. 형사피고인은
      상당한 이유가 없는 한 지체없이 공개재판을 받을 권리를 가진다. 선거에
      있어서 최고득표자가 2인 이상인 때에는 국회의 ���적의원 과반수가 출석한
      공개회의에서 다수표를 얻은 자를 당선자로 한다. 국가는 노인과 청소년의
      복지향상을 위한 정책을 실시할 의무를 진다. 대통령이 제1항의 기간내에
      공포나 재의의 요구를 하지 아니한 때에도 그 법률안은 법률로서 확정된다.
      외국인은 국제법과 조약이 정하는 바에 의하여 그 지위가 보장된다. 모든
      국민은 능력에 따라 균등하게 교육을 받을 권리를 가진다. 국회의 정기회는
      법률이 정하는 바에 의하여 매년 1회 집회되며, 국회의 임시회는 대통령 또는
      국회재적의원 4분의 1 이상의 요구에 의하여 집회된다. 계엄을 선포한 때에는
      대통령은 지체없이 국회에 통고하여야 한다. 법원은 최고법원인 대법원과
      각급법원으로 조직된다. 감사원은 세입·세출의 결산을 매년 검사하여 대통령과
      차년도국회에 그 결과를 보고하여야 한다. 헌법개정은 국회재적의원 과반수
      또는 대통령의 발의로 제안된다. 모든 국민은 종교의 자유를 가진다. 대법원에
      대법관을 둔다. 다만, 법률이 정하는 바에 의하여 대법관이 아닌 법관을 둘 수
      있다. 대통령은 제4항과 제5항의 규정에 의하여 확정된 법률을 지체없이
      공포하여야 한다. 제5항에 의하여 법률이 확정된 후 또는 제4항에 의한
      확정법률이 정부에 이송된 후 5일 이내에 대통령이 공포하지 아니할 때에는
      국회의장이 이를 공포한다. 대법원장과 대법관이 아닌 법관은 대법관회의의
      동의를 얻어 대법원장이 임명한다. 근로조건의 기준은 인간의 존엄성을
      보장하도록 법률로 정한다. 대통령은 제3항과 제4항의 사유를 지체없이
      공포하여야 한다. 법관은 헌법과 법률에 의하여 그 양심에 따라 독립하여
      심판한다. 모든 국민은 법률이 정하는 바에 의하여 납세의 의무를 진다. 위원은
      탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다.
      국채를 모집하거나 예산외에 국가의 부담이 될 계약을 체결하려 할 때에는
      정부는 미리 국회의 의결을 얻어야 한다. 누구든지 체포 또는 구속의 이유와
      변호인의 조력을 받을 권리가 있음을 고지받지 아니하고는 체포 또는 구속을
      당하지 아니한다. 체포 또는 구속을 당한 자의 가족등 법률이 정하는 자에게는
      그 이유와 일시·장소가 지체없이 통지되어야 한다. 감사원의
      조직·직무범위·감사위원의 자격·감사대상공무원의 범위 기타 필요한 사항은
      법률로 정한다. 국회는 국가의 예산안을 심의·확정한다. 군인 또는 군무원이
      아닌 국민은 대한민국의 영역안에서는 중대한 군사상
      기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한 경우와
      비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지 아니한다.
      대통령의 임기가 만료되는 때에는 임기만료 70일 내지 40일전에 후임자를
      선거한다. 대한민국의 경제질서는 개인과 기업의 경제상의 자유와 창의를
      존중함을 기본으로 한다. 제안된 헌법개정안은 대통령이 20일 이상의 기간 이를
      공고하여야 한다. 타인의 범죄행위로 인하여 생명·신체에 대한 피해를 받은
      국민은 법률이 정하는 바에 의하여 국가로부터 구조를 받을 수 있다.
      국회의원은 현행범인인 경우를 제외하고는 회기중 국회의 동의없이 체포 또는
      구금되지 아니한다. 국가는 평생교육을 진흥하여야 한다. 제1항의 해임건의는
      국회재적의원 3분의 1 이상의 발의에 의하여 국회재적의원 과반수의 찬성이
      있어야 한다. 모든 국민은 신속한 재판을 받을 권리를 가진다. 형사피고인은
      상당한 이유가 없는 한 지체없이 공개재판을 받을 권리를 가진다. 선거에
      있어서 최고득표자가 2인 이상인 때에는 국회의 재적의원 과반수가 출석한
      공개회의에서 다수표를 얻은 자를 당선자로 한다. 국가는 노인과 청소년의
      복지향상을 위한 정책을 실시할 의무를 진다. 대통령이 제1항의 기간내에
      공포나 재의의 요구를 하지 아니한 때에도 그 법률안은 법률로서 확정된다.
      외국인은 국제법과 조약이 정하는 바에 의하여 그 지위가 보장된다. 모든
      국민은 능력에 따라 균등하게 교육을 받을 권리를 가진다. 국회의 정기회는
      법률이 정하는 바에 의하여 매년 1회 집회되며, 국회의 임시회는 대통령 또는
      국회재적의원 4분의 1 이상의 요구에 의하여 집회된다. 계엄을 선포한 때에는
      대통령은 지체없이 국회에 통고하여야 한다. 법원은 최고법원인 대법원과
      각급법원으로 조직된다. 감사원은 세입·세출의 결산을 매년 검사하여 대통령과
      차년도국회에 그 결과를 보고하여야 한다. 헌법개정은 국회재적의원 과반수
      또는 대통령의 발의로 제안된다. 모든 국민은 종교의 자유를 가진다.
    </p>
  </div>
</template>
<style lang="scss" scoped></style>
